cargo.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:PostShipment_CSBV>
         <!--Optional:-->
         <tem:Shipmentpurpose>?</tem:Shipmentpurpose>
         <!--Optional:-->
         <tem:ShipperAccNumber>?</tem:ShipperAccNumber>
         <!--Optional:-->
         <tem:ShippingPaymentType>?</tem:ShippingPaymentType>
         <!--Optional:-->
         <tem:BillingAccNumber>?</tem:BillingAccNumber>
         <!--Optional:-->
         <tem:ConsigneeCompName>?</tem:ConsigneeCompName>
         <!--Optional:-->
         <tem:ConsigneeAddLine1>?</tem:ConsigneeAddLine1>
         <!--Optional:-->
         <tem:ConsigneeAddLine2>?</tem:ConsigneeAddLine2>
         <!--Optional:-->
         <tem:ConsigneeAddLine3>?</tem:ConsigneeAddLine3>
         <!--Optional:-->
         <tem:ConsigneeCity>?</tem:ConsigneeCity>
         <!--Optional:-->
         <tem:ConsigneeDivCode>?</tem:ConsigneeDivCode>
         <!--Optional:-->
         <tem:PostalCode>?</tem:PostalCode>
         <!--Optional:-->
         <tem:ConsigneeCountryCode>?</tem:ConsigneeCountryCode>
         <!--Optional:-->
         <tem:ConsigneeCountryName>?</tem:ConsigneeCountryName>
         <!--Optional:-->
         <tem:ConsigneeName>?</tem:ConsigneeName>
         <!--Optional:-->
         <tem:ConsigneePh>?</tem:ConsigneePh>
         <!--Optional:-->
         <tem:ConsigneeEmail>?</tem:ConsigneeEmail>
         <!--Optional:-->
         <tem:RegistrationNumber>?</tem:RegistrationNumber>
         <!--Optional:-->
         <tem:RegistrationNumberTypeCode>?</tem:RegistrationNumberTypeCode>
         <!--Optional:-->
         <tem:RegistrationNumberIssuerCountryCode>?</tem:RegistrationNumberIssuerCountryCode>
         <!--Optional:-->
         <tem:BusinessPartyTypeCode>?</tem:BusinessPartyTypeCode>
         <!--Optional:-->
         <tem:DutiableDeclaredvalue>?</tem:DutiableDeclaredvalue>
         <!--Optional:-->
         <tem:DutiableDeclaredCurrency>?</tem:DutiableDeclaredCurrency>
         <!--Optional:-->
         <tem:ShipNumberOfPieces>?</tem:ShipNumberOfPieces>
         <!--Optional:-->
         <tem:ShipCurrencyCode>?</tem:ShipCurrencyCode>
         <!--Optional:-->
         <tem:ShipPieceWt>?</tem:ShipPieceWt>
         <!--Optional:-->
         <tem:ShipPieceDepth>?</tem:ShipPieceDepth>
         <!--Optional:-->
         <tem:ShipPieceWidth>?</tem:ShipPieceWidth>
         <!--Optional:-->
         <tem:ShipPieceHeight>?</tem:ShipPieceHeight>
         <!--Optional:-->
         <tem:ShipGlobalProductCode>?</tem:ShipGlobalProductCode>
         <!--Optional:-->
         <tem:ShipLocalProductCode>?</tem:ShipLocalProductCode>
         <!--Optional:-->
         <tem:ShipContents>?</tem:ShipContents>
         <!--Optional:-->
         <tem:ShipperId>?</tem:ShipperId>
         <!--Optional:-->
         <tem:ShipperCompName>?</tem:ShipperCompName>
         <!--Optional:-->
         <tem:ShipperAddress1>?</tem:ShipperAddress1>
         <!--Optional:-->
         <tem:ShipperAddress2>?</tem:ShipperAddress2>
         <!--Optional:-->
         <tem:ShipperAddress3>?</tem:ShipperAddress3>
         <!--Optional:-->
         <tem:ShipperCountryCode>?</tem:ShipperCountryCode>
         <!--Optional:-->
         <tem:ShipperCountryName>?</tem:ShipperCountryName>
         <!--Optional:-->
         <tem:ShipperCity>?</tem:ShipperCity>
         <!--Optional:-->
         <tem:ShipperPostalCode>?</tem:ShipperPostalCode>
         <!--Optional:-->
         <tem:ShipperPhoneNumber>?</tem:ShipperPhoneNumber>
         <!--Optional:-->
         <tem:SiteId>?</tem:SiteId>
         <!--Optional:-->
         <tem:Password>?</tem:Password>
         <!--Optional:-->
         <tem:ShipperName>?</tem:ShipperName>
         <!--Optional:-->
         <tem:ShipperRef>?</tem:ShipperRef>
         <!--Optional:-->
         <tem:ShipperRegistrationNumber>?</tem:ShipperRegistrationNumber>
         <!--Optional:-->
         <tem:ShipperRegistrationNumberTypeCode>?</tem:ShipperRegistrationNumberTypeCode>
         <!--Optional:-->
         <tem:ShipperRegistrationNumberIssuerCountryCode>?</tem:ShipperRegistrationNumberIssuerCountryCode>
         <!--Optional:-->
         <tem:ShipperBusinessPartyTypeCode>?</tem:ShipperBusinessPartyTypeCode>
         <!--Optional:-->
         <tem:BillToCompanyName>?</tem:BillToCompanyName>
         <!--Optional:-->
         <tem:BillToContactName>?</tem:BillToContactName>
         <!--Optional:-->
         <tem:BillToAddressLine1>?</tem:BillToAddressLine1>
         <!--Optional:-->
         <tem:BillToCity>?</tem:BillToCity>
         <!--Optional:-->
         <tem:BillToPostcode>?</tem:BillToPostcode>
         <!--Optional:-->
         <tem:BillToSuburb>?</tem:BillToSuburb>
         <!--Optional:-->
         <tem:BillToState>?</tem:BillToState>
         <!--Optional:-->
         <tem:BillToCountryName>?</tem:BillToCountryName>
         <!--Optional:-->
         <tem:BillToCountryCode>?</tem:BillToCountryCode>
         <!--Optional:-->
         <tem:BillToPhoneNumber>?</tem:BillToPhoneNumber>
         <!--Optional:-->
         <tem:IECNo>?</tem:IECNo>
         <!--Optional:-->
         <tem:TermsOfTrade>?</tem:TermsOfTrade>
         <!--Optional:-->
         <tem:Usingecommerce>?</tem:Usingecommerce>
         <!--Optional:-->
         <tem:IsUnderMEISScheme>?</tem:IsUnderMEISScheme>
         <!--Optional:-->
         <tem:GSTIN>?</tem:GSTIN>
         <!--Optional:-->
         <tem:GSTInvNo>?</tem:GSTInvNo>
         <!--Optional:-->
         <tem:GSTInvNoDate>?</tem:GSTInvNoDate>
         <!--Optional:-->
         <tem:NonGSTInvNo>?</tem:NonGSTInvNo>
         <!--Optional:-->
         <tem:NonGSTInvDate>?</tem:NonGSTInvDate>
         <!--Optional:-->
         <tem:IsUsingIGST>?</tem:IsUsingIGST>
         <!--Optional:-->
         <tem:UsingBondorUT>?</tem:UsingBondorUT>
         <!--Optional:-->
         <tem:BankADCode>?</tem:BankADCode>
         <!--Optional:-->
         <tem:Exporter_CompanyName>?</tem:Exporter_CompanyName>
         <!--Optional:-->
         <tem:Exporter_AddressLine1>?</tem:Exporter_AddressLine1>
         <!--Optional:-->
         <tem:Exporter_AddressLine2>?</tem:Exporter_AddressLine2>
         <!--Optional:-->
         <tem:Exporter_AddressLine3>?</tem:Exporter_AddressLine3>
         <!--Optional:-->
         <tem:Exporter_City>?</tem:Exporter_City>
         <!--Optional:-->
         <tem:Exporter_DivisionCode>?</tem:Exporter_DivisionCode>
         <!--Optional:-->
         <tem:Exporter_PostalCode>?</tem:Exporter_PostalCode>
         <!--Optional:-->
         <tem:Exporter_CountryCode>?</tem:Exporter_CountryCode>
         <!--Optional:-->
         <tem:Exporter_CountryName>?</tem:Exporter_CountryName>
         <!--Optional:-->
         <tem:Exporter_PersonName>?</tem:Exporter_PersonName>
         <!--Optional:-->
         <tem:Exporter_PhoneNumber>?</tem:Exporter_PhoneNumber>
         <!--Optional:-->
         <tem:Exporter_Email>?</tem:Exporter_Email>
         <!--Optional:-->
         <tem:Exporter_RegistrationNumber>?</tem:Exporter_RegistrationNumber>
         <!--Optional:-->
         <tem:Exporter_RegistrationNumberTypeCode>?</tem:Exporter_RegistrationNumberTypeCode>
         <!--Optional:-->
         <tem:Exporter_RegistrationNumberIssuerCountryCode>?</tem:Exporter_RegistrationNumberIssuerCountryCode>
         <!--Optional:-->
         <tem:Exporter_BusinessPartyTypeCode>?</tem:Exporter_BusinessPartyTypeCode>
         <!--Optional:-->
         <tem:UseDHLInvoice>?</tem:UseDHLInvoice>
         <!--Optional:-->
         <tem:SignatureName>?</tem:SignatureName>
         <!--Optional:-->
         <tem:SignatureTitle>?</tem:SignatureTitle>
         <!--Optional:-->
         <tem:LicenseNumber>?</tem:LicenseNumber>
         <!--Optional:-->
         <tem:ExpiryDate>?</tem:ExpiryDate>
         <!--Optional:-->
         <tem:ManufactureCountryCode>?</tem:ManufactureCountryCode>
         <!--Optional:-->
         <tem:ManufactureCountryName>?</tem:ManufactureCountryName>
         <!--Optional:-->
         <tem:SerialNumber>?</tem:SerialNumber>
         <!--Optional:-->
         <tem:FOBValue>?</tem:FOBValue>
         <!--Optional:-->
         <tem:Discount>?</tem:Discount>
         <!--Optional:-->
         <tem:Description>?</tem:Description>
         <!--Optional:-->
         <tem:Qty>?</tem:Qty>
         <!--Optional:-->
         <tem:Weight>?</tem:Weight>
         <!--Optional:-->
         <tem:HSCode>?</tem:HSCode>
         <!--Optional:-->
         <tem:CommodityCode>?</tem:CommodityCode>
         <!--Optional:-->
         <tem:CommodityType>?</tem:CommodityType>
         <!--Optional:-->
         <tem:InvoiceRatePerUnit>?</tem:InvoiceRatePerUnit>
         <!--Optional:-->
         <tem:ShipPieceUOM>?</tem:ShipPieceUOM>
         <!--Optional:-->
         <tem:ShipPieceCESS>?</tem:ShipPieceCESS>
         <!--Optional:-->
         <tem:ShipPieceIGSTPercentage>?</tem:ShipPieceIGSTPercentage>
         <!--Optional:-->
         <tem:ShipPieceIGST>?</tem:ShipPieceIGST>
         <!--Optional:-->
         <tem:ShipPieceTaxableValue>?</tem:ShipPieceTaxableValue>
         <!--Optional:-->
         <tem:FreightCharge>?</tem:FreightCharge>
         <!--Optional:-->
         <tem:InsuranceCharge>?</tem:InsuranceCharge>
         <!--Optional:-->
         <tem:TotalIGST>?</tem:TotalIGST>
         <!--Optional:-->
         <tem:CessCharge>?</tem:CessCharge>
         <!--Optional:-->
         <tem:ReverseCharge>?</tem:ReverseCharge>
         <!--Optional:-->
         <tem:PayerGSTVAT>?</tem:PayerGSTVAT>
         <!--Optional:-->
         <tem:IsResponseRequired>?</tem:IsResponseRequired>
         <!--Optional:-->
         <tem:LabelReq>?</tem:LabelReq>
         <!--Optional:-->
         <tem:SpecialService>?</tem:SpecialService>
         <!--Optional:-->
         <tem:InsuredAmount>?</tem:InsuredAmount>
         <!--Optional:-->
         <tem:Invoicevalueinword>?</tem:Invoicevalueinword>
         <!--Optional:-->
         <tem:Placeofsupply>?</tem:Placeofsupply>
         <!--Optional:-->
         <tem:dateofsupply>?</tem:dateofsupply>
         <!--Optional:-->
         <tem:Shipperstatecode>?</tem:Shipperstatecode>
         <!--Optional:-->
         <tem:ShipperstateName>?</tem:ShipperstateName>
         <!--Optional:-->
         <tem:isIndemnityClauseRead>?</tem:isIndemnityClauseRead>
         <!--Optional:-->
         <tem:ACCOUNT_NO>?</tem:ACCOUNT_NO>
         <!--Optional:-->
         <tem:NFEI_FLAG>?</tem:NFEI_FLAG>
         <!--Optional:-->
         <tem:GOV_NONGOV_TYPE>?</tem:GOV_NONGOV_TYPE>
         <!--Optional:-->
         <tem:Destination_Duty_VAT_Charges>?</tem:Destination_Duty_VAT_Charges>
         <!--Optional:-->
         <tem:CustomerBarcodeCode>?</tem:CustomerBarcodeCode>
         <!--Optional:-->
         <tem:CustomerBarcodeText>?</tem:CustomerBarcodeText>
         <!--Optional:-->
         <tem:plt_signature>?</tem:plt_signature>
         <!--Optional:-->
         <tem:DutyAccountNumber>?</tem:DutyAccountNumber>
         <!--Optional:-->
         <tem:plt_signature_Base64>?</tem:plt_signature_Base64>
      </tem:PostShipment_CSBV>
   </soapenv:Body>
</soapenv:Envelope>